; 《汇编语言》王爽 第三版 实验12 编写自己的0号中断处理程序
assume cs:code

code segment

        start:
        ;======================================================================
        ; 将中断处理程序拷贝到内存中一个安全的位置
        ; 教材中指定的安全位置是0000:200h处
        ;======================================================================
                mov ax,cs
                mov ds,ax
                mov si,offset do0

                mov ax,0
                mov es,ax
                mov di,200h

                mov dx,offset do0end - offset do0

                cld
                rep movsb

        ;======================================================================
        ; 将中断例程的入口（也就是0000:200h）注册到中断向量表中
        ;======================================================================
                mov ax,0
                mov es,ax
                mov word ptr es:[0*4],200h
                mov word ptr es:[0*4+2],0

        ;======================================================================
        ; 最后编写一段会引发0号中断的指令
        ;======================================================================
                mov ax,1000h
                mov bh,1
                div bh

        ;======================================================================
        ; 程序退出。在本例中，这里的退出指令其实是执行不到的
        ;======================================================================
                mov ax,4c00h
                int 21h

        ;======================================================================
        ; 中断例程的实现，其实就是将"overflow!"9个字符循环送到显存指定的位置上去
        ;======================================================================
        do0:    jmp short do0start
                db "overflow!"
        do0start:
                mov ax,cs
                mov ds,ax
                mov si,202h

                mov ax,0b800h           ; 设置显存第0页位置
                mov es,ax
                mov di,12*160+36*2      ; 设置要显示的位置

                mov cx,9

        s:      mov al,[si]
                mov es:[di],al
                inc si
                add di,2
                loop s

                mov ax,4c00h            ; 0号中断退出程序，不需要iret
                int 21h
        do0end: nop

code ends

end start